Enums/скт_ВариантыФорматовВыгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>скт_ВариантыФорматовВыгрузки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ANSITXT</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CSV</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DOCX</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JSON</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>MXL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>MXL7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ODS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PDF</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TXT</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>XLSX</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>XML</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольнаяСериализация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/скт_ВариантыФорматовВыгрузки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ТолстыйКлиентУправляемоеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПоИмени(Имя) Экспорт

	Если Метаданные.Перечисления.скт_ВариантыФорматовВыгрузки.ЗначенияПеречисления.Найти(Имя) <> Неопределено Тогда
		Возврат Перечисления.скт_ВариантыФорматовВыгрузки[Имя];	
	КонецЕсли;

КонецФункции // ПоИмени()

Функция РасширениеФайлаДляСохранения(Ссылка) Экспорт

	Если Ссылка = MXL Или Ссылка = MXL7 Тогда
		Возврат "mxl";
	ИначеЕсли Ссылка = PDF Тогда
		Возврат "pdf";
	ИначеЕсли Ссылка = XLSX Тогда
		Возврат "xlsx";
	ИначеЕсли Ссылка = ODS Тогда
		Возврат "ods";
	ИначеЕсли Ссылка = DOCX Тогда
		Возврат "docx";
	ИначеЕсли Ссылка = CSV Тогда
		Возврат "csv";
	ИначеЕсли Ссылка = XML Тогда
		Возврат "xml";
	ИначеЕсли Ссылка = JSON Тогда
		Возврат "json";
	Иначе
		Возврат "txt";
	КонецЕсли;

КонецФункции // РасширениеФайлаДляСохранения()

#КонецОбласти

#КонецЕсли
